app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 01 Aug 2013 07:10:18 UTC +00:00], ["name", "testy"], ["password", "123"], ["updated_at", Thu, 01 Aug 2013 07:10:18 UTC +00:00], ["username", "test"]]
---
	def create
        @user = User.new(user_params)
        @user.admin = false;
		@user.sex = params.require(:user_form).permit(:sex)
		if @user.save